#include <iostream>
using namespace std;

void main() {
	int arr1[10];
	int arr2[10];
	int arr3[10];
	for (int i = 0; i < 10; i++) {
		arr1[i] = 2 * i + 40;
	}
	for (int i = 0; i < 10; i++) {
		arr2[i] = 52 - 2 * i;
	}
	
	int k = 0; // кількість рівних значень в першому та другому масивах
	for (int i = 0; i < 10; i++)//зовнішній цикл, прохід по першому масиву
	{
		for (int j = 0; j < 10; j++)//внутрішній цикл, прохід по другому масиву
		{
			if (arr1[i] == arr2[j])//перевірка на рівність значень в першому та другому масивах
			{
				arr3[k] = arr1[i];//присвоєння значення третьому масиву, яке співпало в перших двох масивах
					k++;//збільшення кількості рівних значень
				break;// вихід з внутрішнього циклу
			}
		}
	}

	int max = arr3[0];
	for (int i = 0; i < 9; i++) {
		if (arr3[i] > max) {  // Перевірка, чи є число двозначним
			max = arr3[i];
		}
	}
	cout << "The largest code has a number: " << max;
}